zephyrproject-rtos/zephyr/drivers/clock_control/clock_stm32_ll_n6.c
/*
 * Copyright (c) 2024 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */


#include <soc.h>
#include <stm32_bitops.h>
#include <stm32_ll_bus.h>
#include <stm32_ll_pwr.h>
#include <stm32_ll_rcc.h>
#include <stm32_ll_utils.h>
#include <stm32_ll_system.h>
#include <zephyr/arch/cpu.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/sys/util.h>
#include <stm32_backup_domain.h>

/* Macros to fill up prescaler values */
#define ic_src_pll(v) CONCAT(LL_RCC_ICCLKSOURCE_PLL, v)
#define hsi_divider(v) CONCAT(LL_RCC_HSI_DIV_, v)
#define ahb_prescaler(v) CONCAT(LL_RCC_AHB_DIV_, v)
#define apb1_prescaler(v) CONCAT(LL_RCC_APB1_DIV_, v)
#define apb2_prescaler(v) CONCAT(LL_RCC_APB2_DIV_, v)
#define apb4_prescaler(v) CONCAT(LL_RCC_APB4_DIV_, v)
#define apb5_prescaler(v) CONCAT(LL_RCC_APB5_DIV_, v)
#define timg_prescaler(v) CONCAT(LL_RCC_TIM_PRESCALER_, v)

#define PLL1_ID		1
#define PLL2_ID		2
#define PLL3_ID		3
#define PLL4_ID		4


static uint32_t get_bus_clock(uint32_t clock, uint32_t prescaler)
{
	return clock / prescaler;
}

__unused
static uint32_t get_msi_frequency(void)
{
#if defined(STM32_MSI_ENABLED)
	if (LL_RCC_MSI_GetFrequency() == LL_RCC_MSI_FREQ_16MHZ) {
		return MHZ(16);
	} else {
		return MHZ(4);
	}
#endif
	return 0;
}

__unused
/** @brief returns the pll source frequency of given pll_id */
static uint32_t get_pllsrc_frequency(int pll_id)
{
	if ((IS_ENABLED(STM32_PLL_SRC_HSI) && pll_id == PLL1_ID) ||
	    (IS_ENABLED(STM32_PLL2_SRC_HSI) && pll_id == PLL2_ID) ||
	    (IS_ENABLED(STM32_PLL3_SRC_HSI) && pll_id == PLL3_ID) ||
	    (IS_ENABLED(STM32_PLL4_SRC_HSI) && pll_id == PLL4_ID)) {
		return STM32_HSI_FREQ;
	} else if ((IS_ENABLED(STM32_PLL_SRC_HSE) && pll_id == PLL1_ID) ||
		   (IS_ENABLED(STM32_PLL2_SRC_HSE) && pll_id == PLL2_ID) ||
		   (IS_ENABLED(STM32_PLL3_SRC_HSE) && pll_id == PLL3_ID) ||
		   (IS_ENABLED(STM32_PLL4_SRC_HSE) && pll_id == PLL4_ID)) {
		return STM32_HSE_FREQ;
	}

	__ASSERT(0, "No PLL Source configured");
	return 0;
}

static uint32_t get_pllout_frequency(int pll_id)
{
	uint32_t pllsrc_freq = get_pllsrc_frequency(pll_id);
	int pllm_div;
	int plln_mul;
	int pllout_div1;
	int pllout_div2;

	switch (pll_id) {
#if defined(STM32_PLL1_ENABLED)
	case PLL1_ID:
		pllm_div = STM32_PLL1_M_DIVISOR;
		plln_mul = STM32_PLL1_N_MULTIPLIER;
		pllout_div1 = STM32_PLL1_P1_DIVISOR;
		pllout_div2 = STM32_PLL1_P2_DIVISOR;
		break;
#endif /* STM32_PLL1_ENABLED */
#if defined(STM32_PLL2_ENABLED)
	case PLL2_ID:
		pllm_div = STM32_PLL2_M_DIVISOR;
		plln_mul = STM32_PLL2_N_MULTIPLIER;
		pllout_div1 = STM32_PLL2_P1_DIVISOR;
		pllout_div2 = STM32_PLL2_P2_DIVISOR;
		break;
#endif /* STM32_PLL2_ENABLED */
#if defined(STM32_PLL3_ENABLED)
	case PLL3_ID:
		pllm_div = STM32_PLL3_M_DIVISOR;
		plln_mul = STM32_PLL3_N_MULTIPLIER;
		pllout_div1 = STM32_PLL3_P1_DIVISOR;
		pllout_div2 = STM32_PLL3_P2_DIVISOR;
		break;
#endif /* STM32_PLL3_ENABLED */
#if defined(STM32_PLL4_ENABLED)
	case PLL4_ID:
		pllm_div = STM32_PLL4_M_DIVISOR;
		plln_mul = STM32_PLL4_N_MULTIPLIER;
		pllout_div1 = STM32_PLL4_P1_DIVISOR;
		pllout_div2 = STM32_PLL4_P2_DIVISOR;
		break;
#endif /* STM32_PLL4_ENABLED */
	default:
		__ASSERT(0, "No PLL configured");
		return 0;
	}

	__ASSERT_NO_MSG(pllm_div && pllout_div1 && pllout_div2);

	return (pllsrc_freq / pllm_div) * plln_mul / (pllout_div1 * pllout_div2);
}

__unused uint32_t get_icout_frequency(uint32_t icsrc, int div)
{
	if (icsrc == LL_RCC_ICCLKSOURCE_PLL1) {
		return get_pllout_frequency(PLL1_ID) / div;
	} else if (icsrc == LL_RCC_ICCLKSOURCE_PLL2) {
		return get_pllout_frequency(PLL2_ID) / div;
	} else if (icsrc == LL_RCC_ICCLKSOURCE_PLL3) {
		return get_pllout_frequency(PLL3_ID) / div;
	} else if (icsrc == LL_RCC_ICCLKSOURCE_PLL4) {
		return get_pllout_frequency(PLL4_ID) / div;
	}

	__ASSERT(0, "No IC Source configured");
	return 0;
}

static uint32_t get_sysclk_frequency(void)
{
#if defined(STM32_SYSCLK_SRC_HSE)
	return STM32_HSE_FREQ;
#elif defined(STM32_SYSCLK_SRC_HSI)
	return STM32_HSI_FREQ;
#elif defined(STM32_SYSCLK_SRC_IC2)
	return get_icout_frequency(LL_RCC_IC2_GetSource(), STM32_IC2_DIV);
#else
	__ASSERT(0, "No SYSCLK Source configured");
	return 0;
#endif

}


/** @brief Verifies clock is part of active clock configuration */
int enabled_clock(uint32_t src_clk)
{
	if ((src_clk == STM32_SRC_SYSCLK) ||
	    (src_clk == STM32_SRC_HCLK1) ||
	    (src_clk == STM32_SRC_HCLK2) ||
	    (src_clk == STM32_SRC_HCLK3) ||
	    (src_clk == STM32_SRC_HCLK4) ||
	    (src_clk == STM32_SRC_HCLK5) ||
	    (src_clk == STM32_SRC_PCLK1) ||
	    (src_clk == STM32_SRC_PCLK2) ||
	    (src_clk == STM32_SRC_PCLK4) ||
	    (src_clk == STM32_SRC_PCLK5) ||
	    (src_clk == STM32_SRC_TIMG) ||
	    ((src_clk == STM32_SRC_LSE) && IS_ENABLED(STM32_LSE_ENABLED)) ||
	    ((src_clk == STM32_SRC_LSI) && IS_ENABLED(STM32_LSI_ENABLED)) ||
	    ((src_clk == STM32_SRC_HSE) && IS_ENABLED(STM32_HSE_ENABLED)) ||
	    ((src_clk == STM32_SRC_HSE_DIV2_OSC) && IS_ENABLED(STM32_HSE_ENABLED)) ||
	    ((src_clk == STM32_SRC_HSI) && IS_ENABLED(STM32_HSI_ENABLED)) ||
	    ((src_clk == STM32_SRC_HSI_DIV) && IS_ENABLED(STM32_HSI_ENABLED)) ||
	    ((src_clk == STM32_SRC_MSI) && IS_ENABLED(STM32_MSI_ENABLED)) ||
	    ((src_clk == STM32_SRC_PLL1) && IS_ENABLED(STM32_PLL1_ENABLED)) ||
	    ((src_clk == STM32_SRC_PLL2) && IS_ENABLED(STM32_PLL2_ENABLED)) ||
	    ((src_clk == STM32_SRC_PLL3) && IS_ENABLED(STM32_PLL3_ENABLED)) ||
	    ((src_clk == STM32_SRC_PLL4) && IS_ENABLED(STM32_PLL4_ENABLED)) ||
	    ((src_clk == STM32_SRC_CKPER) && IS_ENABLED(STM32_CKPER_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC1) && IS_ENABLED(STM32_IC1_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC2) && IS_ENABLED(STM32_IC2_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC3) && IS_ENABLED(STM32_IC3_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC4) && IS_ENABLED(STM32_IC4_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC5) && IS_ENABLED(STM32_IC5_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC6) && IS_ENABLED(STM32_IC6_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC7) && IS_ENABLED(STM32_IC7_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC8) && IS_ENABLED(STM32_IC8_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC9) && IS_ENABLED(STM32_IC9_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC10) && IS_ENABLED(STM32_IC10_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC11) && IS_ENABLED(STM32_IC11_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC12) && IS_ENABLED(STM32_IC12_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC13) && IS_ENABLED(STM32_IC13_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC14) && IS_ENABLED(STM32_IC14_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC15) && IS_ENABLED(STM32_IC15_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC16) && IS_ENABLED(STM32_IC16_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC17) && IS_ENABLED(STM32_IC17_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC18) && IS_ENABLED(STM32_IC18_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC19) && IS_ENABLED(STM32_IC19_ENABLED)) ||
	    ((src_clk == STM32_SRC_IC20) && IS_ENABLED(STM32_IC20_ENABLED))) {
		return 0;
	}

	return -ENOTSUP;
}

static int stm32_clock_control_configure(const struct device *dev,
					 clock_control_subsys_t sub_system, void *data);

static int stm32_clock_control_on(const struct device *dev, clock_control_subsys_t sub_system)
{
	struct stm32_pclken *pclken = (struct stm32_pclken *)(sub_system);

	if (!IN_RANGE(pclken->bus, STM32_PERIPH_BUS_MIN, STM32_PERIPH_BUS_MAX)) {
		/* Source selection entry: apply it instead of toggling a gate */
		return stm32_clock_control_configure(dev, sub_system, NULL);
	}

	/* Set Run clock */
	sys_set_bits(DT_REG_ADDR(DT_NODELABEL(rcc)) + pclken->bus,
		     pclken->enr);

	/* Set Low Power clock */
	sys_set_bits(DT_REG_ADDR(DT_NODELABEL(rcc)) + pclken->bus + STM32_CLOCK_LP_BUS_SHIFT,
		     pclken->enr);

