zephyrproject-rtos/zephyr/drivers/clock_control/clock_stm32_ll_n6.c
	return 0;
}

static int stm32_clock_control_off(const struct device *dev, clock_control_subsys_t sub_system)
{
	struct stm32_pclken *pclken = (struct stm32_pclken *)(sub_system);

	ARG_UNUSED(dev);

	if (!IN_RANGE(pclken->bus, STM32_PERIPH_BUS_MIN, STM32_PERIPH_BUS_MAX)) {
		/* Attempt to toggle a wrong periph clock bit */
		return -ENOTSUP;
	}

	/* Clear Run clock */
	sys_clear_bits(DT_REG_ADDR(DT_NODELABEL(rcc)) + pclken->bus,
		       pclken->enr);

	/* Clear Low Power clock */
	sys_clear_bits(DT_REG_ADDR(DT_NODELABEL(rcc)) + pclken->bus + STM32_CLOCK_LP_BUS_SHIFT,
		       pclken->enr);

	return 0;
}

static int stm32_clock_control_configure(const struct device *dev,
					 clock_control_subsys_t sub_system,
					 void *data)
{
	struct stm32_pclken *pclken = (struct stm32_pclken *)(sub_system);
	uint32_t enr = pclken->enr;
	uint32_t reg = STM32_DT_CLKSEL_REG_GET(enr);
	uint32_t shift = STM32_DT_CLKSEL_SHIFT_GET(enr);
	int err;

	ARG_UNUSED(dev);
	ARG_UNUSED(data);

	err = enabled_clock(pclken->bus);
	if (err < 0) {
		/* Attempt to configure a src clock not available or not valid */
		return err;
	}

	if (pclken->enr == NO_SEL) {
		/* Domain clock is fixed. Nothing to set. Exit */
		return 0;
	}

	stm32_reg_modify_bits((uint32_t *)(DT_REG_ADDR(DT_NODELABEL(rcc)) + reg),
			      STM32_DT_CLKSEL_MASK_GET(enr) << shift,
			      STM32_DT_CLKSEL_VAL_GET(enr) << shift);

	return 0;
}

static int stm32_clock_control_get_subsys_rate(const struct device *dev,
					       clock_control_subsys_t sys,
					       uint32_t *rate)
{
	struct stm32_pclken *pclken = (struct stm32_pclken *)(sys);

	uint32_t sys_clock = get_sysclk_frequency();
	uint32_t ahb_clock = get_bus_clock(sys_clock, STM32_AHB_PRESCALER);

	ARG_UNUSED(dev);

	switch (pclken->bus) {
	case STM32_SRC_SYSCLK:
		*rate = get_sysclk_frequency();
		break;
	case STM32_SRC_HCLK1:
	case STM32_SRC_HCLK2:
	case STM32_SRC_HCLK3:
	case STM32_SRC_HCLK4:
	case STM32_SRC_HCLK5:
	case STM32_CLOCK_BUS_AHB1:
	case STM32_CLOCK_BUS_AHB2:
	case STM32_CLOCK_BUS_AHB3:
	case STM32_CLOCK_BUS_AHB4:
	case STM32_CLOCK_BUS_AHB5:
		*rate = ahb_clock;
		break;
	case STM32_SRC_PCLK1:
	case STM32_CLOCK_BUS_APB1:
	case STM32_CLOCK_BUS_APB1_2:
		*rate = get_bus_clock(ahb_clock, STM32_APB1_PRESCALER);
		break;
	case STM32_SRC_PCLK2:
	case STM32_CLOCK_BUS_APB2:
		*rate = get_bus_clock(ahb_clock, STM32_APB2_PRESCALER);
		break;
	case STM32_SRC_PCLK4:
	case STM32_CLOCK_BUS_APB4:
	case STM32_CLOCK_BUS_APB4_2:
		*rate = get_bus_clock(ahb_clock, STM32_APB4_PRESCALER);
		break;
	case STM32_SRC_PCLK5:
	case STM32_CLOCK_BUS_APB5:
		*rate = get_bus_clock(ahb_clock, STM32_APB5_PRESCALER);
		break;
#if defined(STM32_LSE_ENABLED)
	case STM32_SRC_LSE:
		*rate = STM32_LSE_FREQ;
		break;
#endif /* STM32_LSE_ENABLED */
#if defined(STM32_LSI_ENABLED)
	case STM32_SRC_LSI:
		*rate = STM32_LSI_FREQ;
		break;
#endif /* STM32_LSI_ENABLED */
#if defined(STM32_MSI_ENABLED)
	case STM32_SRC_MSI:
		*rate = get_msi_frequency();
		break;
#endif
#if defined(STM32_HSE_ENABLED)
	case STM32_SRC_HSE:
		*rate = STM32_HSE_FREQ;
		break;
	case STM32_SRC_HSE_DIV2_OSC:
		if (IS_ENABLED(STM32_HSE_DIV2)) {
			*rate = STM32_HSE_FREQ / 2;
		} else {
			*rate = STM32_HSE_FREQ;
		}
		break;
#endif /* STM32_HSE_ENABLED */
#if defined(STM32_HSI_ENABLED)
	case STM32_SRC_HSI:
		*rate = STM32_HSI_FREQ;
		break;
	case STM32_SRC_HSI_DIV:
		*rate = STM32_HSI_FREQ / STM32_HSI_DIVISOR;
		break;
#endif /* STM32_HSI_ENABLED */
	case STM32_SRC_PLL1:
		*rate = get_pllout_frequency(PLL1_ID);
		break;
	case STM32_SRC_PLL2:
		*rate = get_pllout_frequency(PLL2_ID);
		break;
	case STM32_SRC_PLL3:
		*rate = get_pllout_frequency(PLL3_ID);
		break;
	case STM32_SRC_PLL4:
		*rate = get_pllout_frequency(PLL4_ID);
		break;
#if defined(STM32_CKPER_ENABLED)
	case STM32_SRC_CKPER:
		*rate = LL_RCC_GetCLKPClockFreq(LL_RCC_CLKP_CLKSOURCE);
		break;
#endif /* STM32_CKPER_ENABLED */
#if defined(STM32_IC1_ENABLED)
	case STM32_SRC_IC1:
		*rate = get_icout_frequency(LL_RCC_IC1_GetSource(), STM32_IC1_DIV);
		break;
#endif /* STM32_IC1_ENABLED */
#if defined(STM32_IC2_ENABLED)
	case STM32_SRC_IC2:
		*rate = get_icout_frequency(LL_RCC_IC2_GetSource(), STM32_IC2_DIV);
		break;
#endif /* STM32_IC2_ENABLED */
#if defined(STM32_IC3_ENABLED)
	case STM32_SRC_IC3:
		*rate = get_icout_frequency(LL_RCC_IC3_GetSource(), STM32_IC3_DIV);
		break;
#endif /* STM32_IC3_ENABLED */
#if defined(STM32_IC4_ENABLED)
	case STM32_SRC_IC4:
		*rate = get_icout_frequency(LL_RCC_IC4_GetSource(), STM32_IC4_DIV);
		break;
#endif /* STM32_IC4_ENABLED */
#if defined(STM32_IC5_ENABLED)
	case STM32_SRC_IC5:
		*rate = get_icout_frequency(LL_RCC_IC5_GetSource(), STM32_IC5_DIV);
		break;
#endif /* STM32_IC5_ENABLED */
#if defined(STM32_IC6_ENABLED)
	case STM32_SRC_IC6:
		*rate = get_icout_frequency(LL_RCC_IC6_GetSource(), STM32_IC6_DIV);
		break;
#endif /* STM32_IC6_ENABLED */
#if defined(STM32_IC7_ENABLED)
	case STM32_SRC_IC7:
		*rate = get_icout_frequency(LL_RCC_IC7_GetSource(), STM32_IC7_DIV);
		break;
#endif /* STM32_IC7_ENABLED */
#if defined(STM32_IC8_ENABLED)
	case STM32_SRC_IC8:
		*rate = get_icout_frequency(LL_RCC_IC8_GetSource(), STM32_IC8_DIV);
		break;
#endif /* STM32_IC8_ENABLED */
#if defined(STM32_IC9_ENABLED)
	case STM32_SRC_IC9:
		*rate = get_icout_frequency(LL_RCC_IC9_GetSource(), STM32_IC9_DIV);
		break;
#endif /* STM32_IC9_ENABLED */
#if defined(STM32_IC10_ENABLED)
	case STM32_SRC_IC10:
		*rate = get_icout_frequency(LL_RCC_IC10_GetSource(), STM32_IC10_DIV);
		break;
#endif /* STM32_IC10_ENABLED */
#if defined(STM32_IC11_ENABLED)
	case STM32_SRC_IC11:
		*rate = get_icout_frequency(LL_RCC_IC11_GetSource(), STM32_IC11_DIV);
		break;
#endif /* STM32_IC11_ENABLED */
#if defined(STM32_IC12_ENABLED)
	case STM32_SRC_IC12:
		*rate = get_icout_frequency(LL_RCC_IC12_GetSource(), STM32_IC12_DIV);
		break;
#endif /* STM32_IC12_ENABLED */
#if defined(STM32_IC13_ENABLED)
	case STM32_SRC_IC13:
		*rate = get_icout_frequency(LL_RCC_IC13_GetSource(), STM32_IC13_DIV);
		break;
#endif /* STM32_IC13_ENABLED */
#if defined(STM32_IC14_ENABLED)
	case STM32_SRC_IC14:
		*rate = get_icout_frequency(LL_RCC_IC14_GetSource(), STM32_IC14_DIV);
		break;
#endif /* STM32_IC14_ENABLED */
#if defined(STM32_IC15_ENABLED)
	case STM32_SRC_IC15:
		*rate = get_icout_frequency(LL_RCC_IC15_GetSource(), STM32_IC15_DIV);
		break;
#endif /* STM32_IC15_ENABLED */
#if defined(STM32_IC16_ENABLED)
	case STM32_SRC_IC16:
		*rate = get_icout_frequency(LL_RCC_IC16_GetSource(), STM32_IC16_DIV);
		break;
#endif /* STM32_IC16_ENABLED */
#if defined(STM32_IC17_ENABLED)
	case STM32_SRC_IC17:
		*rate = get_icout_frequency(LL_RCC_IC17_GetSource(), STM32_IC17_DIV);
		break;
#endif /* STM32_IC17_ENABLED */
#if defined(STM32_IC18_ENABLED)
	case STM32_SRC_IC18:
		*rate = get_icout_frequency(LL_RCC_IC18_GetSource(), STM32_IC18_DIV);
		break;
#endif /* STM32_IC18_ENABLED */
#if defined(STM32_IC19_ENABLED)
	case STM32_SRC_IC19:
		*rate = get_icout_frequency(LL_RCC_IC19_GetSource(), STM32_IC19_DIV);
		break;
#endif /* STM32_IC19_ENABLED */
#if defined(STM32_IC20_ENABLED)
	case STM32_SRC_IC20:
		*rate = get_icout_frequency(LL_RCC_IC20_GetSource(), STM32_IC20_DIV);
		break;
#endif /* STM32_IC20_ENABLED */
	case STM32_SRC_TIMG:
		*rate = sys_clock / STM32_TIMG_PRESCALER;
		break;
	default:
		return -ENOTSUP;
	}

	if (pclken->div) {
		*rate /= (pclken->div + 1);
	}

