zephyrproject-rtos/zephyr/drivers/clock_control/clock_stm32_ll_n6.c
	return 0;
}

static enum clock_control_status stm32_clock_control_get_status(const struct device *dev,
								clock_control_subsys_t sub_system)
{
	struct stm32_pclken *pclken = (struct stm32_pclken *)sub_system;

	ARG_UNUSED(dev);

	if (IN_RANGE(pclken->bus, STM32_PERIPH_BUS_MIN, STM32_PERIPH_BUS_MAX) == true) {
		/* Gated clocks */
		if ((sys_read32(DT_REG_ADDR(DT_NODELABEL(rcc)) + pclken->bus) & pclken->enr)
		    == pclken->enr) {
			return CLOCK_CONTROL_STATUS_ON;
		} else {
			return CLOCK_CONTROL_STATUS_OFF;
		}
	} else {
		/* Domain clock sources */
		if (enabled_clock(pclken->bus) == 0) {
			return CLOCK_CONTROL_STATUS_ON;
		} else {
			return CLOCK_CONTROL_STATUS_OFF;
		}
	}
}

static DEVICE_API(clock_control, stm32_clock_control_api) = {
	.on = stm32_clock_control_on,
	.off = stm32_clock_control_off,
	.get_rate = stm32_clock_control_get_subsys_rate,
	.get_status = stm32_clock_control_get_status,
	.configure = stm32_clock_control_configure,
};

/*
 * Unconditionally switch the system clock source to HSI.
 */
__unused
static void stm32_clock_switch_to_hsi(void)
{
	/* Enable HSI if not enabled */
	if (LL_RCC_HSI_IsReady() != 1) {
		/* Enable HSI */
		LL_RCC_HSI_Enable();
		while (LL_RCC_HSI_IsReady() != 1) {
			/* Wait for HSI ready */
		}
	}

	/* Set HSI as SYSCLCK source */
	LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSI);
	while (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_HSI) {
	}

	LL_RCC_SetCpuClkSource(LL_RCC_CPU_CLKSOURCE_HSI);
	while (LL_RCC_GetCpuClkSource() != LL_RCC_CPU_CLKSOURCE_STATUS_HSI) {
	}
}

static int set_up_ics(void)
{
#if defined(STM32_IC1_ENABLED)
	LL_RCC_IC1_SetSource(ic_src_pll(STM32_IC1_PLL_SRC));
	LL_RCC_IC1_SetDivider(STM32_IC1_DIV);
	LL_RCC_IC1_Enable();
#endif

#if defined(STM32_IC2_ENABLED)
	LL_RCC_IC2_SetSource(ic_src_pll(STM32_IC2_PLL_SRC));
	LL_RCC_IC2_SetDivider(STM32_IC2_DIV);
	LL_RCC_IC2_Enable();
#endif

#if defined(STM32_IC3_ENABLED)
	LL_RCC_IC3_SetSource(ic_src_pll(STM32_IC3_PLL_SRC));
	LL_RCC_IC3_SetDivider(STM32_IC3_DIV);
	LL_RCC_IC3_Enable();
#endif

#if defined(STM32_IC4_ENABLED)
	LL_RCC_IC4_SetSource(ic_src_pll(STM32_IC4_PLL_SRC));
	LL_RCC_IC4_SetDivider(STM32_IC4_DIV);
	LL_RCC_IC4_Enable();
#endif

#if defined(STM32_IC5_ENABLED)
	LL_RCC_IC5_SetSource(ic_src_pll(STM32_IC5_PLL_SRC));
	LL_RCC_IC5_SetDivider(STM32_IC5_DIV);
	LL_RCC_IC5_Enable();
#endif

#if defined(STM32_IC6_ENABLED)
	LL_RCC_IC6_SetSource(ic_src_pll(STM32_IC6_PLL_SRC));
	LL_RCC_IC6_SetDivider(STM32_IC6_DIV);
	LL_RCC_IC6_Enable();
#endif

#if defined(STM32_IC7_ENABLED)
	LL_RCC_IC7_SetSource(ic_src_pll(STM32_IC7_PLL_SRC));
	LL_RCC_IC7_SetDivider(STM32_IC7_DIV);
	LL_RCC_IC7_Enable();
#endif

#if defined(STM32_IC8_ENABLED)
	LL_RCC_IC8_SetSource(ic_src_pll(STM32_IC8_PLL_SRC));
	LL_RCC_IC8_SetDivider(STM32_IC8_DIV);
	LL_RCC_IC8_Enable();
#endif

#if defined(STM32_IC9_ENABLED)
	LL_RCC_IC9_SetSource(ic_src_pll(STM32_IC9_PLL_SRC));
	LL_RCC_IC9_SetDivider(STM32_IC9_DIV);
	LL_RCC_IC9_Enable();
#endif

#if defined(STM32_IC10_ENABLED)
	LL_RCC_IC10_SetSource(ic_src_pll(STM32_IC10_PLL_SRC));
	LL_RCC_IC10_SetDivider(STM32_IC10_DIV);
	LL_RCC_IC10_Enable();
#endif

#if defined(STM32_IC11_ENABLED)
	LL_RCC_IC11_SetSource(ic_src_pll(STM32_IC11_PLL_SRC));
	LL_RCC_IC11_SetDivider(STM32_IC11_DIV);
	LL_RCC_IC11_Enable();
#endif

#if defined(STM32_IC12_ENABLED)
	LL_RCC_IC12_SetSource(ic_src_pll(STM32_IC12_PLL_SRC));
	LL_RCC_IC12_SetDivider(STM32_IC12_DIV);
	LL_RCC_IC12_Enable();
#endif

#if defined(STM32_IC13_ENABLED)
	LL_RCC_IC13_SetSource(ic_src_pll(STM32_IC13_PLL_SRC));
	LL_RCC_IC13_SetDivider(STM32_IC13_DIV);
	LL_RCC_IC13_Enable();
#endif

#if defined(STM32_IC14_ENABLED)
	LL_RCC_IC14_SetSource(ic_src_pll(STM32_IC14_PLL_SRC));
	LL_RCC_IC14_SetDivider(STM32_IC14_DIV);
	LL_RCC_IC14_Enable();
#endif

#if defined(STM32_IC15_ENABLED)
	LL_RCC_IC15_SetSource(ic_src_pll(STM32_IC15_PLL_SRC));
	LL_RCC_IC15_SetDivider(STM32_IC15_DIV);
	LL_RCC_IC15_Enable();
#endif

#if defined(STM32_IC16_ENABLED)
	LL_RCC_IC16_SetSource(ic_src_pll(STM32_IC16_PLL_SRC));
	LL_RCC_IC16_SetDivider(STM32_IC16_DIV);
	LL_RCC_IC16_Enable();
#endif

#if defined(STM32_IC17_ENABLED)
	LL_RCC_IC17_SetSource(ic_src_pll(STM32_IC17_PLL_SRC));
	LL_RCC_IC17_SetDivider(STM32_IC17_DIV);
	LL_RCC_IC17_Enable();
#endif

#if defined(STM32_IC18_ENABLED)
	LL_RCC_IC18_SetSource(ic_src_pll(STM32_IC18_PLL_SRC));
	LL_RCC_IC18_SetDivider(STM32_IC18_DIV);
	LL_RCC_IC18_Enable();
#endif

#if defined(STM32_IC19_ENABLED)
	LL_RCC_IC19_SetSource(ic_src_pll(STM32_IC19_PLL_SRC));
	LL_RCC_IC19_SetDivider(STM32_IC19_DIV);
	LL_RCC_IC19_Enable();
#endif

#if defined(STM32_IC20_ENABLED)
	LL_RCC_IC20_SetSource(ic_src_pll(STM32_IC20_PLL_SRC));
	LL_RCC_IC20_SetDivider(STM32_IC20_DIV);
	LL_RCC_IC20_Enable();
#endif

	return 0;
}

static int set_up_plls(void)
{
#if defined(STM32_PLL1_ENABLED)
	/* TODO: Do not switch systematically on HSI if not needed */
	stm32_clock_switch_to_hsi();

	LL_RCC_PLL1_Disable();

	/* Configure PLL source : Can be HSE, HSI, MSI */
	if (IS_ENABLED(STM32_PLL_SRC_HSE)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL1_SetSource(LL_RCC_PLLSOURCE_HSE);
	} else if (IS_ENABLED(STM32_PLL_SRC_MSI)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL1_SetSource(LL_RCC_PLLSOURCE_MSI);
	} else if (IS_ENABLED(STM32_PLL_SRC_HSI)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL1_SetSource(LL_RCC_PLLSOURCE_HSI);
	} else {
		return -ENOTSUP;
	}

	/* Disable PLL1 modulation spread-spectrum */
	LL_RCC_PLL1_DisableModulationSpreadSpectrum();

	/* Disable bypass to use the PLL VCO */
	if (LL_RCC_PLL1_IsEnabledBypass()) {
		LL_RCC_PLL1_DisableBypass();
	}

	/* Configure PLL */
	LL_RCC_PLL1_SetM(STM32_PLL1_M_DIVISOR);
	LL_RCC_PLL1_SetN(STM32_PLL1_N_MULTIPLIER);
	LL_RCC_PLL1_SetP1(STM32_PLL1_P1_DIVISOR);
	LL_RCC_PLL1_SetP2(STM32_PLL1_P2_DIVISOR);

	/* Disable fractional mode */
	LL_RCC_PLL1_SetFRACN(0);
	LL_RCC_PLL1_DisableFractionalModulationSpreadSpectrum();

	LL_RCC_PLL1_AssertModulationSpreadSpectrumReset();

	/* Enable post division */
	if (!LL_RCC_PLL1P_IsEnabled()) {
		LL_RCC_PLL1P_Enable();
	}

