zephyrproject-rtos/zephyr/drivers/clock_control/clock_stm32_ll_n6.c
	LL_RCC_PLL1_Enable();
	while (LL_RCC_PLL1_IsReady() != 1U) {
	}
#endif /* STM32_PLL1_ENABLED */

#if defined(STM32_PLL2_ENABLED)
	LL_RCC_PLL2_Disable();

	/* Configure PLL source : Can be HSE, HSI, MSI */
	if (IS_ENABLED(STM32_PLL2_SRC_HSE)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL2_SetSource(LL_RCC_PLLSOURCE_HSE);
	} else if (IS_ENABLED(STM32_PLL2_SRC_MSI)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL2_SetSource(LL_RCC_PLLSOURCE_MSI);
	} else if (IS_ENABLED(STM32_PLL2_SRC_HSI)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL2_SetSource(LL_RCC_PLLSOURCE_HSI);
	} else {
		return -ENOTSUP;
	}

	/* Disable PLL2 modulation spread-spectrum */
	LL_RCC_PLL2_DisableModulationSpreadSpectrum();

	/* Disable bypass to use the PLL VCO */
	if (LL_RCC_PLL2_IsEnabledBypass()) {
		LL_RCC_PLL2_DisableBypass();
	}

	/* Configure PLL */
	LL_RCC_PLL2_SetM(STM32_PLL2_M_DIVISOR);
	LL_RCC_PLL2_SetN(STM32_PLL2_N_MULTIPLIER);
	LL_RCC_PLL2_SetP1(STM32_PLL2_P1_DIVISOR);
	LL_RCC_PLL2_SetP2(STM32_PLL2_P2_DIVISOR);

	/* Disable fractional mode */
	LL_RCC_PLL2_SetFRACN(0);
	LL_RCC_PLL2_DisableFractionalModulationSpreadSpectrum();

	LL_RCC_PLL2_AssertModulationSpreadSpectrumReset();

	/* Enable post division */
	if (!LL_RCC_PLL2P_IsEnabled()) {
		LL_RCC_PLL2P_Enable();
	}

	LL_RCC_PLL2_Enable();
	while (LL_RCC_PLL2_IsReady() != 1U) {
	}
#endif

#if defined(STM32_PLL3_ENABLED)
	LL_RCC_PLL3_Disable();

	/* Configure PLL source : Can be HSE, HSI, MSI */
	if (IS_ENABLED(STM32_PLL3_SRC_HSE)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL3_SetSource(LL_RCC_PLLSOURCE_HSE);
	} else if (IS_ENABLED(STM32_PLL3_SRC_MSI)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL3_SetSource(LL_RCC_PLLSOURCE_MSI);
	} else if (IS_ENABLED(STM32_PLL3_SRC_HSI)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL3_SetSource(LL_RCC_PLLSOURCE_HSI);
	} else {
		return -ENOTSUP;
	}

	/* Disable PLL3 modulation spread-spectrum */
	LL_RCC_PLL3_DisableModulationSpreadSpectrum();

	/* Disable bypass to use the PLL VCO */
	if (LL_RCC_PLL3_IsEnabledBypass()) {
		LL_RCC_PLL3_DisableBypass();
	}

	/* Configure PLL */
	LL_RCC_PLL3_SetM(STM32_PLL3_M_DIVISOR);
	LL_RCC_PLL3_SetN(STM32_PLL3_N_MULTIPLIER);
	LL_RCC_PLL3_SetP1(STM32_PLL3_P1_DIVISOR);
	LL_RCC_PLL3_SetP2(STM32_PLL3_P2_DIVISOR);

	/* Disable fractional mode */
	LL_RCC_PLL3_SetFRACN(0);
	LL_RCC_PLL3_DisableFractionalModulationSpreadSpectrum();

	LL_RCC_PLL3_AssertModulationSpreadSpectrumReset();

	/* Enable post division */
	if (!LL_RCC_PLL3P_IsEnabled()) {
		LL_RCC_PLL3P_Enable();
	}

	LL_RCC_PLL3_Enable();
	while (LL_RCC_PLL3_IsReady() != 1U) {
	}
#endif

#if defined(STM32_PLL4_ENABLED)
	LL_RCC_PLL4_Disable();

	/* Configure PLL source : Can be HSE, HSI, MSI */
	if (IS_ENABLED(STM32_PLL4_SRC_HSE)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL4_SetSource(LL_RCC_PLLSOURCE_HSE);
	} else if (IS_ENABLED(STM32_PLL4_SRC_MSI)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL4_SetSource(LL_RCC_PLLSOURCE_MSI);
	} else if (IS_ENABLED(STM32_PLL4_SRC_HSI)) {
		/* Main PLL configuration and activation */
		LL_RCC_PLL4_SetSource(LL_RCC_PLLSOURCE_HSI);
	} else {
		return -ENOTSUP;
	}

	/* Disable PLL4 modulation spread-spectrum */
	LL_RCC_PLL4_DisableModulationSpreadSpectrum();

	/* Disable bypass to use the PLL VCO */
	if (LL_RCC_PLL4_IsEnabledBypass()) {
		LL_RCC_PLL4_DisableBypass();
	}

	/* Configure PLL */
	LL_RCC_PLL4_SetM(STM32_PLL4_M_DIVISOR);
	LL_RCC_PLL4_SetN(STM32_PLL4_N_MULTIPLIER);
	LL_RCC_PLL4_SetP1(STM32_PLL4_P1_DIVISOR);
	LL_RCC_PLL4_SetP2(STM32_PLL4_P2_DIVISOR);

	/* Disable fractional mode */
	LL_RCC_PLL4_SetFRACN(0);
	LL_RCC_PLL4_DisableFractionalModulationSpreadSpectrum();

	LL_RCC_PLL4_AssertModulationSpreadSpectrumReset();

	/* Enable post division */
	if (!LL_RCC_PLL4P_IsEnabled()) {
		LL_RCC_PLL4P_Enable();
	}

	LL_RCC_PLL4_Enable();
	while (LL_RCC_PLL4_IsReady() != 1U) {
	}
#endif

	return 0;
}

static void set_up_fixed_clock_sources(void)
{
	if (IS_ENABLED(STM32_HSE_ENABLED)) {
		/* Check if need to enable HSE bypass feature or not */
		if (IS_ENABLED(STM32_HSE_BYPASS)) {
			LL_RCC_HSE_EnableBypass();
		} else {
			LL_RCC_HSE_DisableBypass();
		}

		if (IS_ENABLED(STM32_HSE_DIV2)) {
			LL_RCC_HSE_SelectHSEDiv2AsDiv2Clock();
		} else {
			LL_RCC_HSE_SelectHSEAsDiv2Clock();
		}

		/* Enable HSE */
		LL_RCC_HSE_Enable();
		while (LL_RCC_HSE_IsReady() != 1) {
		/* Wait for HSE ready */
		}
	}

	if (IS_ENABLED(STM32_HSI_ENABLED)) {
		/* Enable HSI oscillator */
		LL_RCC_HSI_Enable();
		while (LL_RCC_HSI_IsReady() != 1) {
		}
		/* HSI divider configuration */
		LL_RCC_HSI_SetDivider(hsi_divider(STM32_HSI_DIVISOR));
	}

	if (IS_ENABLED(STM32_LSE_ENABLED)) {
		/* Enable the power interface clock */
		LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_PWR);

		stm32_backup_domain_enable_access();

		/* Configure driving capability */
		LL_RCC_LSE_SetDriveCapability(STM32_LSE_DRIVING << RCC_LSECFGR_LSEDRV_Pos);

		if (IS_ENABLED(STM32_LSE_BYPASS)) {
			/* Configure LSE bypass */
			LL_RCC_LSE_EnableBypass();
		}

		/* Enable LSE Oscillator */
		LL_RCC_LSE_Enable();
		/* Wait for LSE ready */
		while (!LL_RCC_LSE_IsReady()) {
		}

		stm32_backup_domain_disable_access();
	}

	if (IS_ENABLED(STM32_LSI_ENABLED)) {
		/* Enable LSI oscillator */
		LL_RCC_LSI_Enable();
		while (LL_RCC_LSI_IsReady() != 1) {
		}
	}

#if defined(STM32_MSI_ENABLED)
	/* Set up MSI clock */
	if (IS_ENABLED(STM32_MSI_ENABLED)) {
		/* Set frequency of MSI */
		if (STM32_MSI_RANGE == 1) {
			LL_RCC_MSI_SetFrequency(LL_RCC_MSI_FREQ_16MHZ);
		} else {
			LL_RCC_MSI_SetFrequency(LL_RCC_MSI_FREQ_4MHZ);
		}

		/* enable MSI */
		LL_RCC_MSI_Enable();

		while (LL_RCC_MSI_IsReady() != 1) {
			/* Wait for MSI ready */
		}
	}
#endif
}

int stm32_clock_control_init(const struct device *dev)
{
	int r = 0;

	ARG_UNUSED(dev);

	/* For now, enable clocks (including low_power ones) of misc RAM */
	uint32_t misc_ram = LL_MEM_AXISRAM1 | LL_MEM_AXISRAM2 | LL_MEM_AHBSRAM1 | LL_MEM_AHBSRAM2 |
			   LL_MEM_BKPSRAM | LL_MEM_FLEXRAM | LL_MEM_CACHEAXIRAM | LL_MEM_VENCRAM;
	LL_MEM_EnableClock(misc_ram);
	LL_MEM_EnableClockLowPower(misc_ram);

