zephyrproject-rtos/zephyr/drivers/clock_control/clock_stm32_ll_n6.c
	/*
	 * A chain-loading bootloader is expected to have initialized the clock tree
	 * and external XSPI memory used by the application. Reinitializing the
	 * application-domain RCC can make that memory inaccessible while code or
	 * data is being fetched. Keep the SRAM gate setup above, preserve the
	 * retained clock configuration, and refresh the CMSIS clock value.
	 *
	 * The application's devicetree must describe the retained clock and
	 * external-memory configuration.
	 */
	if (IS_ENABLED(CONFIG_CLOCK_STM32_N6_PRESERVE_BOOT_CONFIG)) {
		SystemCoreClockUpdate();
		return 0;
	}

	/* Set up individual enabled clocks */
	set_up_fixed_clock_sources();

	/* Set up PLLs */
	r = set_up_plls();
	if (r < 0) {
		__ASSERT(0, "PLL setup failed");
		return r;
	}

	/* Preset the prescalers prior to choosing SYSCLK */
	/* Prevents APB clock to go over limits */
	/* Set buses (AHB, APB1, APB2, APB4 & APB5) prescalers */
	LL_RCC_SetAHBPrescaler(ahb_prescaler(STM32_AHB_PRESCALER));
	LL_RCC_SetAPB1Prescaler(apb1_prescaler(STM32_APB1_PRESCALER));
	LL_RCC_SetAPB2Prescaler(apb2_prescaler(STM32_APB2_PRESCALER));
	LL_RCC_SetAPB4Prescaler(apb4_prescaler(STM32_APB4_PRESCALER));
	LL_RCC_SetAPB5Prescaler(apb5_prescaler(STM32_APB5_PRESCALER));

	/* Set TIMG presclar */
	LL_RCC_SetTIMPrescaler(timg_prescaler(STM32_TIMG_PRESCALER));

	if (IS_ENABLED(STM32_CKPER_ENABLED)) {
		LL_MISC_EnableClock(LL_PER);
		LL_MISC_EnableClockLowPower(LL_PER);
		while (LL_MISC_IsEnabledClock(LL_PER) != 1) {
		}
	}

	/* Set up ICs */
	r = set_up_ics();
	if (r < 0) {
		return r;
	}

	/* Set up sys clock */
	if (IS_ENABLED(STM32_SYSCLK_SRC_HSE)) {
		/* Set sysclk source to HSE */
		LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSE);
		while (LL_RCC_GetSysClkSource() !=
					LL_RCC_SYS_CLKSOURCE_STATUS_HSE) {
		}
	} else if (IS_ENABLED(STM32_SYSCLK_SRC_HSI)) {
		/* Set sysclk source to HSI */
		stm32_clock_switch_to_hsi();
	} else if (IS_ENABLED(STM32_SYSCLK_SRC_IC2)) {
		/* Set sysclk source to IC2 */
		LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_IC2_IC6_IC11);
		while (LL_RCC_GetSysClkSource() !=
					LL_RCC_SYS_CLKSOURCE_STATUS_IC2_IC6_IC11) {
		}
	} else if (IS_ENABLED(STM32_SYSCLK_SRC_MSI)) {
		/* Set sysclk source to MSI */
		LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_MSI);
		while (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_MSI) {
		}
	} else {
		return -ENOTSUP;
	}

	/* Update CMSIS variable */
	SystemCoreClock = CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC;

	return r;
}

/**
 * @brief RCC device, note that priority is intentionally set to 1 so
 * that the device init runs just after SOC init
 */
DEVICE_DT_DEFINE(DT_NODELABEL(rcc),
		    &stm32_clock_control_init,
		    NULL,
		    NULL, NULL,
		    PRE_KERNEL_1,
		    CONFIG_CLOCK_CONTROL_INIT_PRIORITY,
		    &stm32_clock_control_api);
